app/controllers/movies_controller.rb

  def index
    if session[:ratings]==nil
	      params[:ratings]=Hash[Movie.all_ratings.map {|rating| [rating,"1"] }]
	      session[:ratings] = params[:ratings]
    end

    if params[:ratings]==nil
	#flash.keep
	  redirect_to movies_path

    end

    @checkboxes=params[:ratings]

    if params.has_key?(:sort)
	@sort=params[:sort].to_s
	@movies = Movie.order(params[:sort].to_s).find(:all, :conditions => { :rating => params[:ratings].keys})
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'R') ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", :rating]]